jpnorair/OpenTag/include/board/stm32l0xx/nucleo_LRWAN1.h
/* Copyright 2013-2014 JP Norair
  *
  * Licensed under the OpenTag License, Version 1.0 (the "License");
  * you may not use this file except in compliance with the License.
  * You may obtain a copy of the License at
  *
  * http://www.indigresso.com/wiki/doku.php?id=opentag:license_1_0
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  */
/**
  * @file       /board/stm32l0xx/nucleo_LRWAN1.h
  * @author     JP Norair
  * @version    R101
  * @date       29 May 2017
  * @brief      Board Configuration for Nucleo STM32L073 with LoRa module
  * @ingroup    Platform
  *
  * Do not include this file, include /platform/config.h
  *
  * SPECIAL NOTE: search for "note BOARD Macro" lines in this file.  These
  * must be ported to other STM32L boards, because the OpenTag STM32L platform 
  * implementation depends on them.
  *
  ******************************************************************************
  */
  

#ifndef __nucleo_LRWAN1_H
#define __nucleo_LRWAN1_H

/// MCU definition for the board must be the first thing
#define __STM32L073RZ__

#include <app/app_config.h>
#include <platform/hw/STM32L0xx_config.h>
#include <platform/interrupts.h>

/// This is a major difference between the LRWAN1 system and the unladen Nucleo
#if OT_FEATURE(M2)
#   define __USE_RADIO
#endif


/// It's possible to add a GNSS shield to this device, although support is coming later
//#define __HAS_GNSS


/// Macro settings: ENABLED, DISABLED, NOT_AVAILABLE
#ifdef ENABLED
#   undef ENABLED
#endif
#define ENABLED  1

#ifdef DISABLED
#   undef DISABLED
#endif
#define DISABLED  0

#ifdef NOT_AVAILABLE
#   undef NOT_AVAILABLE
#endif
#define NOT_AVAILABLE   DISABLED


/// Configuration of system with or without Radio
#if defined(__USE_RADIO)
#   ifdef __NULL_RADIO__
//#       include <io/radio_null/config.h>
#   else
#		define __SX127x__
#		define __SX1272__
#       include <io/sx127x/config.h>
#   endif
#endif

#if defined(__HAS_GNSS)
#   ifdef __NULL_GNSS__
#       include <io/gnss_null/config.h>
#   else
#       define __UBX_MAXM8x__
#       define __UBX_MAXM8C__
//#       include <io/ubx_gnss.h>
#   endif
#endif






/** Additional RF Front End Parameters and Settings <BR>
  * ========================================================================<BR>
  * We assume you are using the included antenna and matching circuit, which 
  * has a 50% efficiency (-3dB) with 1dB insertion loss
  */
#ifdef __USE_RADIO
//#   define RF_PARAM_BAND    866              //Can be 866 or 915
#   define RF_PARAM_BAND    915
#   define RF_HDB_ATTEN     8                //Half dB attenuation (units = 0.5dB), used to scale TX power
#   define RF_HDB_RXATTEN   6
#   define RF_RSSI_OFFSET   RF_HDB_RXATTEN   //Offset applied to RSSI calculation
#endif



/** MCU Configuration settings      <BR>
  * ========================================================================<BR>
  * Implemented capabilities of the STM32L variants on this board/build
  *
  * On this board you can use USB or UART for MPipe, I2C is not implemented
  * yet.  To select USB, make sure "MCU_CONFIG_MPIPECDC" is set to "ENABLED".
  * To use UART, set "MCU_CONFIG_MPIPECDC" to "DISABLED" and the script 
  * below will use UART instead.
  *
  */
#define MCU_CONFIG(VAL)                 MCU_CONFIG_##VAL   // FEATURE 
#define MCU_CONFIG_MULTISPEED           DISABLED                            // Allows usage of MF-HF clock boosting
#define MCU_CONFIG_MAPEEPROM            DISABLED
#define MCU_CONFIG_MPIPECDC             DISABLED                            // USB-CDC MPipe implementation
#define MCU_CONFIG_MPIPEI2C             (NOT_AVAILABLE && !MCU_CONFIG_MPIPECDC)
#define MCU_CONFIG_MPIPEUART            (ENABLED && !MCU_CONFIG_MPIPECDC && !MCU_CONFIG_MPIPEI2C) 
#define MCU_CONFIG_MEMCPYDMA            ENABLED                             // MEMCPY DMA should be lower priority than MPIPE DMA
#define MCU_CONFIG_USB                  (MCU_CONFIG_MPIPECDC == ENABLED)
#define MCU_CONFIG_VOLTLEVEL            2   //(2-(MCU_CONFIG_MPIPEI2C==ENABLED))




/** Platform Memory Configuration <BR>
  * ========================================================================<BR>
  * OpenTag needs to know where it can put Nonvolatile memory (file system) and
  * how much space it can allocate for filesystem.  For this configuration, 
  * Veelite is put into EEPROM.
  *
  * The STM32L0 uses 128 byte Flash pages and 2KB Flash sectors.  Therefore, it
  * is best to allocate the FS in Flash on 2KB boundaries because this is the 
  * resolution that can be write protected (or, as with FS, *NOT* write 
  * protected).  Best practice with STM32 chips is to put the FS at the back of
  * of the Flash space because this seems to work best with the debugger HW.
  */

// For building with non-default memory amounts
#ifndef SRAM_SIZE
#   define SRAM_SIZE            (20*1024)
#endif
#ifndef EEPROM_SIZE
#   define EEPROM_SIZE          (6*1024)
#endif
#ifndef FLASH_SIZE
#   define FLASH_SIZE           (192*1024)
#endif
#ifndef EEPROM_SAVE_SIZE
#   define EEPROM_SAVE_SIZE     (0)
#endif

// EEPROM LOCAL DATA
#define EEPROM_LOCAL_ADDR       (EEPROM_START_ADDR + EEPROM_SIZE - EEPROM_SAVE_SIZE)
#define EEPROM_LOCAL_U8         (ot_u8*)EEPROM_LOCAL_ADDR
#define EEPROM_LOCAL_U16        (ot_u16*)EEPROM_LOCAL_ADDR
#define EEPROM_LOCAL_U32        (ot_u32*)EEPROM_LOCAL_ADDR


// If not using EEPROM (using Flash) you need to coordinate some of these Flash Addresses
// with those entered into the Linker Script.  Use the vlsram linker script.
#if (defined(__NOEEPROM__) || defined(__VLSRAM__))
#   ifndef __VLSRAM__
#       define __VLSRAM__
#   endif
#   define FLASH_FS_END         (0x08018000)
#	define FLASH_NUM_PAGES      (FLASH_SIZE/FLASH_PAGE_SIZE)
#	define FLASH_FS_ALLOC       (4*1024) 							// 4KB FS memory
#	define FLASH_FS_ADDR        (FLASH_FS_END-FLASH_FS_ALLOC)	    // FS Flash Start Addr
#	define FLASH_FS_PAGES       (FLASH_FS_ALLOC / FLASH_PAGE_SIZE)
#	define FLASH_FS_FALLOWS     (0)			                        // No fallows

