jpnorair/OpenTag/include/board/stm32l0xx/nucleo_LRWAN1.h
// Using EEPROM: Pages figure is irrelevant
#else
#	define FLASH_NUM_PAGES      (FLASH_SIZE/FLASH_PAGE_SIZE)
#	define FLASH_FS_ADDR        (EEPROM_START_ADDR)
#	define FLASH_FS_PAGES       0
#	define FLASH_FS_FALLOWS     0 
#	define FLASH_FS_ALLOC       (EEPROM_SIZE - EEPROM_SAVE_SIZE) 
#endif







/** Board-based Feature Settings <BR>
  * ========================================================================<BR>
  * 1. One button is supported on PC13.  The button must be attached by the 
  *    user.  It is active low.  Other buttons could be added on the unused
  *    pins, but only one is pre-defined.
  * 
  * 2. Two LEDs are defined on PC2, PC3, but the user must attach LEDs.
  *    <LI> TRIG1 (typically Orange LED) is on PC2.  It typically indicates 
  *         that the radio is on and in RX mode.</LI>
  *    <LI> TRIG2 (typically Green LED) is on PC3.  It typically indicates
  *         that the radio is on and in TX mode.</LI>
  *
  * 3. MPIPE can support UART TX/RX (no flow control) or I2C.  MPIPE supports
  *    a "break" mode, in both I2C and UART interfaces, where a break character 
  *    is transmitted by the client ahead of the packet in order to wakeup the 
  *    system.  This reduces power requirements.  Unfortunately, short-sighted
  *    design of the LoRa expansion board prevents the Break feature from 
  *    working on this board.
  *
  * 4. The Debug and Upload interface is SWD.  There is no serial bootloader
  *    capability at the time of writing.  
  *    (Editorial Note: A ST-Link-V2 has SWD and a low price of US$25.  
  *    It can work with OpenOCD, so the toolchain is still very cheap.)
  * 
  * 5. The SX127x SPI benefits from the highest speed clock up to 20 MHz.
  */
#define BOARD_FEATURE(VAL)              BOARD_FEATURE_##VAL
#define BOARD_PARAM(VAL)                BOARD_PARAM_##VAL

#define BOARD_FEATURE_MPIPE             ENABLED
#define BOARD_FEATURE_USBCONVERTER      BOARD_FEATURE_MPIPE         // Is UART connected via USB converter?
#define BOARD_FEATURE_MPIPE_BREAK       DISABLED                    // Send/receive leading break for wakeup
#define BOARD_FEATURE_MPIPE_DIRECT      (BOARD_FEATURE_MPIPE_BREAK != ENABLED) 

// If you have installed GNSS extension board from Haystack
#define BOARD_FEATURE_UBX_GNSS          DISABLED

// MPIPE UART modes are deprecated.  Only Break-mode or Direct-Mode should be used.
//#define BOARD_FEATURE_MPIPE_CS          DISABLED                    // Chip-Select / DTR wakeup control
//#define BOARD_FEATURE_MPIPE_FLOWCTL     DISABLED                    // RTS/CTS style flow control 

#define BOARD_FEATURE_LFXTAL            ENABLED                                 // LF XTAL used as Clock source
#define BOARD_FEATURE_HFXTAL            DISABLED                                // HF XTAL used as Clock source
#define BOARD_FEATURE_HFBYPASS          DISABLED                                // Use an externally driven oscillator
#define BOARD_FEATURE_HFCRS             (BOARD_FEATURE_HFXTAL != ENABLED)       // Use STM32L0's Clock-Recovery-System for USB
#define BOARD_FEATURE_RFXTAL            DISABLED                                // XTAL for RF chipset
#define BOARD_FEATURE_RFXTALOUT         DISABLED
#define BOARD_FEATURE_PLL               (MCU_CONFIG_MULTISPEED == ENABLED)
#define BOARD_FEATURE_STDSPEED          (MCU_CONFIG_MULTISPEED == ENABLED)
#define BOARD_FEATURE_FULLSPEED         ENABLED
#define BOARD_FEATURE_FULLXTAL          DISABLED
#define BOARD_FEATURE_FLANKSPEED        (MCU_CONFIG_MULTISPEED == ENABLED)
#define BOARD_FEATURE_FLANKXTAL         (BOARD_FEATURE_HFCRS != ENABLED)
#if (MCU_CONFIG(USB) && BOARD_FEATURE(PLL) && (BOARD_FEATURE(HFXTAL) || BOARD_FEATURE(HFBYPASS)))
#   warning "Nucleo board does not normally support XTAL-based USB.  Make sure you have a crystal mounted."
#   define BOARD_FEATURE_USBPLL         ENABLED
#elif MCU_CONFIG(USB)
#   undef BOARD_FEATURE_HFCRS
#   define BOARD_FEATURE_HFCRS          ENABLED
#   define BOARD_FEATURE_USBPLL         DISABLED
#else
#   define BOARD_FEATURE_USBPLL         DISABLED
#endif

// Number of Triggers/LEDs
#define BOARD_PARAM_TRIGS               2

// MPIPE speed: ignored with USB MPipe.  
// Actual speed will be closest supported bps.
#define BOARD_PARAM_MPIPEBAUD           115200

// Clock descriptions
#define BOARD_PARAM_LFHz                32768
#define BOARD_PARAM_LFtol               0.00002
#define BOARD_PARAM_MFHz                4200000
#define BOARD_PARAM_MFmult              1                       // Main CLK = HFHz * (MFmult/MFdiv)
#define BOARD_PARAM_MFdiv               1
#define BOARD_PARAM_MFtol               0.02
#define BOARD_PARAM_HFHz                16000000
#define BOARD_PARAM_HFtol               0.02
#define BOARD_PARAM_HFppm               20000
//#define BOARD_PARAM_RFHz                48000000
//#define BOARD_PARAM_RFdiv               6
//#define BOARD_PARAM_RFout               (BOARD_PARAM_RFHz/BOARD_PARAM_RFdiv)
//#define BOARD_PARAM_RFtol               0.00003
#define BOARD_PARAM_PLLout              96000000
#define BOARD_PARAM_PLLmult             (BOARD_PARAM_PLLout/BOARD_PARAM_HFHz)
#define BOARD_PARAM_PLLdiv              3
#define BOARD_PARAM_PLLHz               (BOARD_PARAM_PLLout/BOARD_PARAM_PLLdiv)

// Clock divider specs: These are defined at FULL SPEED
#define BOARD_PARAM_AHBCLKDIV           1                       // AHB Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB2CLKDIV          1                       // APB2 Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB1CLKDIV          1                       // APB1 Clk = Main CLK / AHBCLKDIV

// SWD Interface: Nucleo used SWD in all cases, never JTAG.
// The SWO (Trace) pin is unfortunately consumed by the LoRa module
#define BOARD_SWDIO_PORT                GPIOA
#define BOARD_SWDIO_PINNUM              13
#define BOARD_SWDIO_PIN                 (1<<13)
#define BOARD_SWDCLK_PORT               GPIOA
#define BOARD_SWDCLK_PINNUM             14
#define BOARD_SWDCLK_PIN                (1<<14)
//#define BOARD_TRACESWO_PORTNUM          1
//#define BOARD_TRACESWO_PORT             GPIOB
//#define BOARD_TRACESWO_PINNUM           (1<<3)
//#define BOARD_TRACESWO_PIN              3

// SW1 is implemented on PC13, active low.
#define BOARD_SW1_PORTNUM               2                   // Port C
#define BOARD_SW1_PORT                  GPIOC
#define BOARD_SW1_PINNUM                13
#define BOARD_SW1_PIN                   (1<<BOARD_SW1_PINNUM)
#define BOARD_SW1_POLARITY              0
#define BOARD_SW1_PULLING               0

// TEST0, TEST1 pins are on PC4, PC5.
// They are not necessary, but Haystack uses them for manufacturing tests.
// They are usually outputs but they could be pull-up inputs also.
#define BOARD_TEST0_PORTNUM             2                   // Port C
#define BOARD_TEST0_PORT                GPIOC
#define BOARD_TEST0_PINNUM              4
#define BOARD_TEST0_PIN                 (1<<BOARD_TEST0_PINNUM)
#define BOARD_TEST0_POLARITY            0
#define BOARD_TEST0_PULLING             1
#define BOARD_TEST1_PORTNUM             2                   // Port C
#define BOARD_TEST1_PORT                GPIOC
#define BOARD_TEST1_PINNUM              5
#define BOARD_TEST1_PIN                 (1<<BOARD_TEST1_PINNUM)
#define BOARD_TEST1_POLARITY            0
#define BOARD_TEST1_PULLING             1

// LED interface is implemented on PC2 and PC3, which means you
// need to connect your own LEDS to these pins.
// Additionally, there is an optional Red-LED spec'ed on PC10
#define BOARD_LEDG_PORTNUM              2                   // Port C
#define BOARD_LEDG_PORT                 GPIOC
#define BOARD_LEDG_PINNUM               2
#define BOARD_LEDG_PIN                  (1<<BOARD_LEDG_PINNUM)
#define BOARD_LEDG_POLARITY             0
#define BOARD_LEDO_PORTNUM              2                   // Port C
#define BOARD_LEDO_PORT                 GPIOC
#define BOARD_LEDO_PINNUM               3
#define BOARD_LEDO_PIN                  (1<<BOARD_LEDO_PINNUM)
#define BOARD_LEDO_POLARITY             0
#define BOARD_LEDR_PORTNUM              2                   // Port C
#define BOARD_LEDR_PORT                 GPIOC
#define BOARD_LEDR_PINNUM               10
#define BOARD_LEDR_PIN                  (1<<BOARD_LEDR_PINNUM)
#define BOARD_LEDR_POLARITY             0

// LoRa Module SX127x Bus
#ifdef __USE_RADIO
#   define BOARD_RFGPIO_0PORTNUM        0        // "D2" : PA10
#   define BOARD_RFGPIO_0PORT           GPIOA
#   define BOARD_RFGPIO_0PINNUM         10
#   define BOARD_RFGPIO_0PIN            (1<<BOARD_RFGPIO_0PINNUM)
#   define BOARD_RFGPIO_1PORTNUM        1        // "D3" : PB3
#   define BOARD_RFGPIO_1PORT           GPIOB
#   define BOARD_RFGPIO_1PINNUM         3
#   define BOARD_RFGPIO_1PIN            (1<<BOARD_RFGPIO_1PINNUM)
#   define BOARD_RFGPIO_2PORTNUM        1        // "D4" : PB5
#   define BOARD_RFGPIO_2PORT           GPIOB
#   define BOARD_RFGPIO_2PINNUM         5
#   define BOARD_RFGPIO_2PIN            (1<<BOARD_RFGPIO_2PINNUM)
#   define BOARD_RFGPIO_3PORTNUM        1        // "D5" : PB4
#   define BOARD_RFGPIO_3PORT           GPIOB
#   define BOARD_RFGPIO_3PINNUM         4
#   define BOARD_RFGPIO_3PIN            (1<<BOARD_RFGPIO_3PINNUM)

