jpnorair/OpenTag/include/board/stm32l0xx/nucleo_LRWAN1.h
// Flash should be enabled while awake and in sleep unless you seriously modify 
// OpenTag to run exclusively from RAM
#define _MIFCLK_N       RCC_AHBENR_MIFEN
#define _MIFCLK_LP      RCC_AHBSMENR_MIFSMEN

// DMA is used in MEMCPY and thus it could be needed at any time during active
// runtime.  So, the active-clock must be enabled permanently.
#if (MCU_CONFIG_MEMCPYDMA)
#   define _DMACLK_N    RCC_AHBENR_DMA1EN
#   define _DMACLK_LP   RCC_AHBSMENR_DMA1SMEN
#else
#   define _DMACLK_N    0
#   define _DMACLK_LP   RCC_AHBSMENR_DMA1SMEN
#   define _DMACLK_DYNAMIC
#endif

// This board enabled all GPIO on ports A, B, C, and D.
// On startup (_SU), port H is also enabled
// On Stop (LP) Port A should be open for UART or USB
// On Stop-with-RF (LPRF), Ports A and B should be open
#define _GPIOCLK_N      (RCC_IOPENR_GPIOAEN | RCC_IOPENR_GPIOBEN | RCC_IOPENR_GPIOCEN | RCC_IOPENR_GPIODEN)
#define _GPIOCLK_SU     (_GPIOCLK_N | RCC_IOPENR_GPIOHEN)
#define _GPIOCLK_LP     (RCC_IOPENR_GPIOAEN)
#define _GPIOCLK_LPRF   (_GPIOCLK_LP | RCC_IOPENR_GPIOBEN)

#define _IOPENR_STARTUP  (_DMACLK_N | _MIFCLK_N | _CRCCLK_N | _GPIOCLK_SU)
#define _IOPENR_RUNTIME  (_CRYPCLK_N | _MIFCLK_N | _CRCCLK_N | _GPIOCLK_N)


//@note BOARD Macro for Peripheral Clock initialization at startup
static inline void BOARD_PERIPH_INIT(void) {
    // 1. AHB Clock Setup for Active Mode & Sleep
    RCC->AHBENR     = (_CRYPCLK_N | _RNGCLK_N | _TOUCHCLK_N | _CRCCLK_N | _MIFCLK_N | _DMACLK_N);
    RCC->AHBSMENR   = (_CRYPCLK_LP| _RNGCLK_LP| _TOUCHCLK_LP| _CRCCLK_LP| _MIFCLK_LP| _DMACLK_LP);

    // 2. I/O Clock Setup for Sleep and Startup
    RCC->IOPENR     = _IOPENR_STARTUP;

    // 3. APB2 Clocks in Active Mode.  APB2 is the high-speed peripheral bus.  
    // The default is all-off, and it is the job of the peripheral drivers to 
    // enable/disable their clocks as needed.  SYSCFG and Debug Module are on
    // without needing driver support
#   if defined(__DEBUG__) || defined(__PROTO__)
    RCC->APB2ENR   = (RCC_APB2ENR_DBGMCUEN | RCC_APB2ENR_SYSCFGEN);
#   else
    RCC->APB2ENR   = (RCC_APB2ENR_SYSCFGEN);
#   endif

    // 3. APB1 Clocks in Active Mode.  APB1 is the low-speed peripheral bus.
    // The default is all-off, and it is the job of the peripheral drivers to 
    // enable/disable their clocks as needed.  The exceptions are LPTIM1 and 
    // PWR, which are fundamental to OpenTag.
    RCC->APB1ENR   = (RCC_APB1ENR_LPTIM1EN | RCC_APB1ENR_PWREN); 
    //RCC->APB1SMENR = (RCC_APB1ENR_LPTIM1EN | RCC_APB1ENR_PWREN);  // Enabled by default
}



//@note BOARD Macro for DMA peripheral enabling
static inline void BOARD_DMA_CLKON(void) {
#ifdef _DMACLK_DYNAMIC
    RCC->AHBENR    |= RCC_AHBENR_DMA1EN;
#endif
}

static inline void BOARD_DMA_CLKOFF(void) {
#ifdef _DMACLK_DYNAMIC
    RCC->AHBENR    &= ~RCC_AHBENR_DMA1EN;
#endif
}



///@note BOARD Macro for EXTI initialization.  See also EXTI macros at the
///      bottom of the page.
///      - Radio EXTIs: {GPIO-0, -1, -3} : {PA10, PB3, PB4}
#ifdef __USE_RADIO
#   define _EXTICR3_PORTNUM     BOARD_RFGPIO_1PORTNUM
#   define _EXTICR4_PORTNUM     BOARD_RFGPIO_3PORTNUM
#   define _EXTICR5_PORTNUM     BOARD_RFGPIO_2PORTNUM
#   define _EXTICR10_PORTNUM    BOARD_RFGPIO_0PORTNUM
#else
#   define _EXTICR3_PORTNUM     0
#   define _EXTICR4_PORTNUM     0
#   define _EXTICR5_PORTNUM     0
#   define _EXTICR10_PORTNUM    0
#endif
static inline void BOARD_EXTI_STARTUP(void) {
    // EXTI0-3: A0, A1, B2, RFGPIO-1 (B3)
    SYSCFG->EXTICR[0]   = (0 << 0) \
                        | (0 << 4) \
                        | (1 << 8) \
                        | (_EXTICR3_PORTNUM << 12);
    
    // EXTI4-7: RFGPIO-3 (B4), RFGPIO-2 (B5), B6, C7
    SYSCFG->EXTICR[1]   = (_EXTICR4_PORTNUM << 0) \
                        | (_EXTICR5_PORTNUM << 4) \
                        | (1 << 8) \
                        | (2 << 12);
                        
    // EXTI8-11: A8, A9, RFGPIO-0 (A10), A11
    SYSCFG->EXTICR[2]   = (0 << 0) \
                        | (0 << 4) \
                        | (_EXTICR10_PORTNUM << 8) \
                        | (0 << 12);

    // EXTI12-15: A12, SW1 (C13), B14, A15
    SYSCFG->EXTICR[3]   = (0 << 0) \
                        | (BOARD_SW1_PORTNUM << 4) \
                        | (1 << 8) \
                        | (0 << 12);
}



///@note BOARD Macro for initializing GPIO ports at startup, pursuant to the
///      connections in the schematic of this board.  This funciotn
static inline void BOARD_PORT_STARTUP(void) {  
    /// Initialize ports/pins exclusively used within this platform module.
    /// A. Trigger Pins
    /// B. Random Number ADC pins: A Zener can be used to generate noise.
    
    /// Configure Port A IO.  
    // - A0:  Radio Reset, which starts as a floating input and the driver later sorts-out
    // - A1:  Analog Input
    // - A2:  UART-TX, which is ALT push-pull output
    // - A3:  UART-RX, which is ALT push-pull input
    // - A4:  Analog Input
    // - A5:7 are SPI bus, set to ALT.
    // - A8:  This is where Radio GPIO5 goes, if enabled.  Otherwise, Unused Analog-In
    // - A9:  Unused Analog-In
    // - A10: Radio GPIO0, Hi-Z input
    // - A11:12 are inputs which are not available on the Arduino pinout (USB)
    // - A13:14 are SWD, set to ALT
    // - A15: Unused Analog-In
    
#   if defined(BOARD_RFGPIO_5PIN)
#       define _GPIO_MODER_PA8  GPIO_MODER_IN
#   else
#       define _GPIO_MODER_PA8  GPIO_MODER_ANALOG
#   endif
    GPIOA->MODER    = (GPIO_MODER_IN    << (0*2)) \
                    | (GPIO_MODER_ANALOG << (1*2)) \
                    | (GPIO_MODER_ALT    << (2*2)) \
                    | (GPIO_MODER_ALT    << (3*2)) \
                    | (GPIO_MODER_ANALOG << (4*2)) \
                    | (GPIO_MODER_ALT    << (5*2)) \
                    | (GPIO_MODER_ALT    << (6*2)) \
                    | (GPIO_MODER_ALT    << (7*2)) \
                    | (_GPIO_MODER_PA8   << (8*2)) \
                    | (GPIO_MODER_ANALOG << (9*2)) \
                    | (GPIO_MODER_IN     << (10*2)) \
                    | (GPIO_MODER_IN     << (11*2)) \
                    | (GPIO_MODER_IN     << (12*2)) \
                    | (GPIO_MODER_ALT    << (13*2)) \
                    | (GPIO_MODER_ALT    << (14*2)) \
                    | (GPIO_MODER_ANALOG << (15*2));

    GPIOA->OTYPER   = 0;
    
    GPIOA->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (2*2)) \
                    | (GPIO_OSPEEDR_10MHz << (3*2)) \
                    | (GPIO_OSPEEDR_10MHz << (5*2)) \
                    | (GPIO_OSPEEDR_10MHz << (6*2)) \
                    | (GPIO_OSPEEDR_10MHz << (7*2)) \
                    | (GPIO_OSPEEDR_40MHz << (13*2)) \
                    | (GPIO_OSPEEDR_40MHz << (14*2));
    
