jpnorair/OpenTag/include/board/stm32l0xx/nucleo_LRWAN1.h
    GPIOA->PUPDR    = (1 << (3*2)) \
                    | (1 << (13*2)) | (2 << (14*2));
    

#   ifndef __USE_RADIO
    GPIOA->AFR[0]   = (4 << (BOARD_UART_TXPINNUM*4)) \
                    | (4 << (BOARD_UART_RXPINNUM*4));
#   else
    GPIOA->AFR[0]   = (4 << (BOARD_UART_TXPINNUM*4)) \
                    | (4 << (BOARD_UART_RXPINNUM*4)) \
                    | (0 << ((BOARD_RFSPI_MOSIPINNUM)*4)) \
                    | (0 << ((BOARD_RFSPI_MISOPINNUM)*4)) \
                    | (0 << ((BOARD_RFSPI_SCLKPINNUM)*4));
#   endif

    /// If USB is used, set ALT.
    ///@todo validate this ALT implementation.
#   if (MCU_CONFIG(USB))
    GPIOA->AFR[1]   = (10 << ((BOARD_USB_DMPINNUM-8)*4)) \
                    | (10 << ((BOARD_USB_DPPINNUM-8)*4));
#   endif

    /// Configure Port B IO.
    /// Port B is used for external (module) IO.
    // - B0:  Analog Input
    // - B1:2 are unused and set to Analog mode
    // - B3:  Radio GPIO input, else unused Analog
    // - B4:  Radio GPIO input, else unused Analog
    // - B5:  Radio GPIO input, else unused Analog
    // - B6:  Radio SPI-NSS, an output
    // - B7:  unused and set to Analog mode
    // - B8:9 are setup for I2C bus: They start as output with Open Drain
    // - B10: is a PWM output, set to Analog until configured
    // - B11:15 are unused and set to Analog mode
#   if defined(__USE_RADIO)
    GPIOB->BSRR     = BOARD_RFSPI_NSSPIN;
#       define _GPIO_MODER_PB3  GPIO_MODER_IN
#       define _GPIO_MODER_PB4  GPIO_MODER_IN
#       define _GPIO_MODER_PB5  GPIO_MODER_IN
#       define _GPIO_MODER_PB6  GPIO_MODER_OUT
#   else
#       define _GPIO_MODER_PB3  GPIO_MODER_ANALOG
#       define _GPIO_MODER_PB4  GPIO_MODER_ANALOG
#       define _GPIO_MODER_PB5  GPIO_MODER_ANALOG
#       define _GPIO_MODER_PB6  GPIO_MODER_ANALOG
#   endif
    
    GPIOB->OTYPER   = (1 << (8)) | (1 << (9));
    GPIOB->BSRR     = (1 << (8)) | (1 << (9));
    GPIOB->MODER    = (GPIO_MODER_ANALOG << (0*2)) \
                    | (GPIO_MODER_ANALOG << (1*2)) \
                    | (GPIO_MODER_ANALOG << (2*2)) \
                    | (_GPIO_MODER_PB3 << (3*2)) \
                    | (_GPIO_MODER_PB4 << (4*2)) \
                    | (_GPIO_MODER_PB5 << (5*2)) \
                    | (_GPIO_MODER_PB6 << (6*2)) \
                    | (GPIO_MODER_ANALOG << (7*2)) \
                    | (GPIO_MODER_OUT    << (8*2)) \
                    | (GPIO_MODER_OUT    << (9*2)) \
                    | (GPIO_MODER_ANALOG << (10*2)) \
                    | (GPIO_MODER_ANALOG << (11*2)) \
                    | (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_ANALOG << (13*2)) \
                    | (GPIO_MODER_ANALOG << (14*2)) \
                    | (GPIO_MODER_ANALOG << (15*2));
    
    GPIOB->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (8*2)) \
                    | (GPIO_OSPEEDR_10MHz << (9*2));
    
    /// Configure Port C IO.
    /// Port C is used only for USB sense and 32kHz crystal driving
    // - C0:1   are analog inputs
    // - C2:3   LED0 and LED1 Output Triggers: Push-Pull output or Open Drain depending on Polarity
    // - C4:5   TEST0 and TEST1 outputs
    // - C6:9   are unused and set to analog
    // - C10    LED2 (optional red): Push-Pull output or Open Drain depending on Polarity
    // - C11:12 are unused and set to analog
    // - C13 is the user button, set to input HiZ
    // - C14:15 are 32kHz crystal driving, they are set in a particular way
#   if (BOARD_LEDG_POLARITY == 0)
#       define _GPIO_OTYPER_PC2     (1<<2)
#       define _GPIO_ODR_PC2        (1<<2)
#   else
#       define _GPIO_OTYPER_PC2     0
#       define _GPIO_ODR_PC2        0
#   endif
#   if (BOARD_LEDO_POLARITY == 0)
#       define _GPIO_OTYPER_PC3     (1<<3)
#       define _GPIO_ODR_PC3        (1<<3)
#   else
#       define _GPIO_OTYPER_PC3     0
#       define _GPIO_ODR_PC3        0
#   endif
#   if (BOARD_LEDR_POLARITY == 0)
#       define _GPIO_OTYPER_PC10    (1<<10)
#       define _GPIO_ODR_PC10       (1<<10)
#   else
#       define _GPIO_OTYPER_PC10    0
#       define _GPIO_ODR_PC10       0
#   endif
#   ifdef __USE_RADIO
#       define _GPIO_ODR_RFRESET    BOARD_RFCTL_RESETPIN
#   else
#       define _GPIO_ODR_RFRESET    0
#   endif

    GPIOC->OTYPER   = (_GPIO_OTYPER_PC2 | _GPIO_OTYPER_PC3 | _GPIO_OTYPER_PC10);
    GPIOC->BSRR     = (_GPIO_ODR_PC2 | _GPIO_ODR_PC3 | _GPIO_ODR_PC10 | _GPIO_ODR_RFRESET);
    

    GPIOC->MODER    = (GPIO_MODER_ANALOG << (0*2)) \
                    | (GPIO_MODER_ANALOG << (1*2)) \
                    | (GPIO_MODER_OUT    << (2*2)) \
                    | (GPIO_MODER_OUT    << (3*2)) \
                    | (GPIO_MODER_OUT    << (4*2)) \
                    | (GPIO_MODER_OUT    << (5*2)) \
                    | (GPIO_MODER_ANALOG << (6*2)) \
                    | (GPIO_MODER_ANALOG << (7*2)) \
                    | (GPIO_MODER_ANALOG << (8*2)) \
                    | (GPIO_MODER_ANALOG << (9*2)) \
                    | (GPIO_MODER_OUT    << (10*2)) \
                    | (GPIO_MODER_ANALOG << (11*2)) \
                    | (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_IN     << (13*2)) \
                    | (GPIO_MODER_OUT    << (14*2)) \
                    | (GPIO_MODER_ALT    << (15*2));
    
    /// Configure Port D I/O
    /// Port D is completely unused and set by default to Analog
    GPIOD->MODER    = 0xFFFFFFFF;
    
    // Assert Port H as HiZ
    GPIOH->MODER    = (GPIO_MODER_IN << (0*2))
                    | (GPIO_MODER_IN << (1*2));
    
    /// Configure Port H for Crystal Bypass
    /// By default it is set to HiZ input.  It is changed on-demand in FW
    
    // Disable GPIOH, it is never altered after this.
    RCC->IOPENR = _IOPENR_RUNTIME;
}


/*
static inline void BOARD_OPEN_FLASH(void* start, void* end) {
/// STM32L0 reserves flash on 4KB boundaries
#   define _F_LAST ((FLASH_SIZE-1) >> 12)
    ot_u32 a, b;
    ot_u32 bmask1, bmask2;
    
    // 4KB Boundaries: a to b
    a = ((ot_u32)start - 0x08000000) >> 12;
    b = ((ot_u32)last - 0x08000000) >> 12;
    
