jpnorair/OpenTag/include/board/stm32l0xx/nucleo_LRWAN1.h
    // Make sure a, b are <= _F_LAST. Alter accordingly
    if (a > _F_LAST) a = _F_LAST;
    if (b > _F_LAST) b = _F_LAST;
    
    // Create bitmask from a and b bit positions
    switch ( ((a>=32)<<1) | (b>=32) ) {
        // a < 32, b < 32
        case 0: bmask1  = 1 << a;
                bmask1 |= (bmask1-1);
                bmask1 ^= (1<<b) - 1;
                bmask2  = 0;
                break;
                
        // a < 32, b >= 32
        case 1: bmask1  = 1 << a;
                bmask1 |= (bmask1-1);
                bmask2  = 1 << b;
                bmask2 |= ~(bmask2-1);
                break;
        
        // a >= 32, b < 32 -- implausible
        case 2: return;
        
        // a >= 32, b >= 32
        case 3: bmask1  = 0;
                bmask2  = 1 << a;
                bmask2 |= (bmask2-1);
                bmask2 ^= (1<<b) - 1;
                break;
        
    }
    
    // Apply bitmasks to WRPROT registers
    
    //FLASH->WRPROT1  = __REV(bmask1);
    //FLASH->WRPROT2  = __REV(bmask2);
}
*/


static inline void BOARD_RFSPI_CLKON(void) {
#ifdef __USE_RADIO
    ot_u32 spi_moder;
    spi_moder   = BOARD_RFSPI_PORT->MODER;
    spi_moder  &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                  | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                  | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
    spi_moder  |= (GPIO_MODER_ALT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                | (GPIO_MODER_ALT << (BOARD_RFSPI_MISOPINNUM*2)) \
                | (GPIO_MODER_ALT << (BOARD_RFSPI_MOSIPINNUM*2));
    
    BOARD_RFSPI_PORT->MODER = spi_moder;
#endif
}

static inline void BOARD_RFSPI_CLKOFF(void) {
#ifdef __USE_RADIO
    ot_u32 spi_moder;
    spi_moder   = BOARD_RFSPI_PORT->MODER;
    spi_moder  &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                  | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                  | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
    spi_moder  |= (GPIO_MODER_OUT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                | (GPIO_MODER_IN << (BOARD_RFSPI_MISOPINNUM*2)) \
                | (GPIO_MODER_OUT << (BOARD_RFSPI_MOSIPINNUM*2));
    
    BOARD_RFSPI_PORT->MODER = spi_moder;
#endif
}



#include <platform/timers.h>    // for systim_stop_clocker()
static inline void BOARD_STOP(ot_int code) {
/// "code" comes from sys_sig_powerdown, but it is usually 0-3.
/// - code = 0 or 1: Don't go to STOP mode at all, this function shouldn't be called.
/// - code = 2: Keep ports alive that have peripherals that can be active in STOP
/// - code = 3: Shut down all ports, only
/// Those are the only modes that should call this inline function.

#   define _RF_ACTIVE_STOPFLAGS (PWR_CR_LPSDSR | PWR_CR_CSBF)
#   define _RF_OFF_STOPFLAGS    (PWR_CR_LPSDSR | PWR_CR_FWU | PWR_CR_ULP | PWR_CR_CSBF)

    static const ot_u16 stop_flags[2] = {  
        _RF_ACTIVE_STOPFLAGS, _RF_OFF_STOPFLAGS };
    
    static const ot_u32 rcc_flags[2] = {
        _GPIOCLK_LPRF, _GPIOCLK_LP };
        //_GPIOCLK_N, 0 };
    
    ot_u16 scratch;
    code &= 1;
    
    // Shut down unnecessary ports & kill SysTick.  Systick is the devil.
    RCC->IOPENR     = rcc_flags[code];
    SysTick->CTRL   = 0;
    
    // Prepare SCB->SCR register for DeepSleep instead of regular Sleep.
    SCB->SCR       |= SCB_SCR_SLEEPDEEP_Msk;
    
    // Prepare PWR->CR register for Stop Mode
    scratch         = PWR->CR;
    scratch        &= ~(PWR_CR_DBP | PWR_CR_PDDS | PWR_CR_LPSDSR);
    scratch        |= stop_flags[code];
    PWR->CR         = scratch;
    
    // Clear any EXTIs -- too late for them now
    EXTI->PR        = 0;
    
    // Enable Interrupts and send "Wait For Interrupt" Cortex-M instruction
    platform_enable_interrupts();
    __WFI();
    
    // ---- Device is in STOP mode here ---- //
    
    // On Wakeup (from STOP) clear flags, re-enable backup register area, 
    // immediately reset SLEEPDEEP bit, and Re-enable Ports
    PWR->CR        |= (PWR_CR_DBP | PWR_CR_CWUF | PWR_CR_CSBF);
    SCB->SCR       &= ~((ot_u32)SCB_SCR_SLEEPDEEP_Msk);
    RCC->IOPENR     = _IOPENR_RUNTIME;

#   undef _RF_ACTIVE_STOPFLAGS 
#   undef _RF_OFF_STOPFLAGS 
}




static inline void BOARD_PORT_STANDBY() {
///@todo implement this!
}




///@note BOARD Macro for initializing the STM32 PVD Module (voltage monitor) at
///      startup.  Only relevant for battery-powered boards.
static inline void BOARD_POWER_STARTUP(void) {
#   if (MCU_FEATURE_SVMONITOR == ENABLED)
    // Level0 is 1.9V, each level is +0.2V.  Check your battery spec and change
    // the _LEVx component to match it.  Typical Li-Ion undervoltage is 2.7V.
    PWR->CR    |= PWR_CR_PLS_LEV0 | PWR_CR_PVDE;  
#   endif
}



///@note BOARD Macro for initializing the STM32 Crystal startup routine, done
///      at startup.  It must startup ALL the crystals that you want to run 
///      during normal operation.
static inline void BOARD_XTAL_STARTUP(void) {
}



///@note BOARD Macros for turning-on and turning-off the High-speed XTAL.
///      High speed XTAL does not exist on this board, so it is empty.
static inline void BOARD_HSXTAL_ON(void) {
}
static inline void BOARD_HSXTAL_OFF(void) {
}



///@brief BOARD Macros for turning-on and turning-off the USB Clock, which may
///       be implemented in a lot of different ways depending on the board, the
///       MCU, and the configuration.
///
///@note  For STM32L0, the standard implementation is to use the CRS system in
///       combination with the PLL.
///

static inline void BOARD_USBCLK_ON(void) {
#if BOARD_FEATURE(USBPLL)
    RCC->APB1ENR |= RCC_APB1ENR_USBEN;
    platform_ext_pllon();
#else
    platform_ext_usbcrson();
#endif
}

static inline void BOARD_USBCLK_OFF(void) {
#if BOARD_FEATURE(USBPLL)
    platform_ext_plloff();
    RCC->APB1ENR &= ~RCC_APB1ENR_USBEN;
#else
    platform_ext_usbcrsoff();
#endif
}

static inline void BOARD_USB_PORTENABLE(void) {
    USB->BCDR |= (ot_u32)USB_BCDR_DPPU;
    
    /*BOARD_USB_PORT->MODER  |= (2 << (BOARD_USB_DMPINNUM*2)) \
                              | (2 << (BOARD_USB_DPPINNUM*2)); */
}

